[{"courses":[{"credit":0,"description":"This course introduces the C++ Programming Language as a means of developing structured programs. Students will be taught to develop algorithms using top-down stepwise refinement. Students will be introduced to the concept of Object Oriented programming. In addition, students will get a thorough exposure to C++ syntax and debugging techniques.","number":"120","subject":"BCS","title":"Foundations of Computer Programming I"},{"credit":0,"description":"This is an introductory course that provides students with the knowledge to stay current and informed in a technology-oriented, global society. Students will receive instruction in basic computer concepts and terminology, the fundamentals of the Windows operating system and have hands-on experience at the beginning to intermediate level using Microsoft Excel and Access. The Internet will be used to supplement textbook and lecture materials. Note: Students taking this course may not receive credit for BCS 102 or 202.","number":"160","subject":"BCS","title":"Computers, Society and Technology"},{"credit":0,"description":"This course expands the knowledge and skills of Foundations of Computer Programming I. Among the topics covered are: arrays, pointers, strings, classes, data abstraction, inheritance, composition and overloading.","number":"230","subject":"BCS","title":"Foundations of Computer Programming II"},{"credit":0,"description":"This course is designed for students with some experience with programming. The syntax of the Java programming language, object-oriented programming, creating graphical user interfaces (GUI), exceptions, file input\/output (I\/O), and how to create Java applications and applets will be covered.","number":"345","subject":"BCS","title":"Java Programming"},{"credit":0,"description":"This course is an introduction to the C# (“C-Sharp”) programming language for students with existing programming experience. The course covers the syntax of the C# programming language, .NET (“dot net”) infrastructure, creating graphical user interfaces, using databases, using web services, and multithreading. Students will be required to complete a number of practical programming assignments to solidify their knowledge of the language and its application.","number":"426","subject":"BCS","title":"C# Programming"}],"student":{"id":"101","major":"Computer Programming","name":"Rose Rodriguez"}},{"courses":[{"credit":0,"description":"This course introduces the C++ Programming Language as a means of developing structured programs. Students will be taught to develop algorithms using top-down stepwise refinement. Students will be introduced to the concept of Object Oriented programming. In addition, students will get a thorough exposure to C++ syntax and debugging techniques.","number":"120","subject":"BCS","title":"Foundations of Computer Programming I"},{"credit":0,"description":"This is an introductory course that provides students with the knowledge to stay current and informed in a technology-oriented, global society. Students will receive instruction in basic computer concepts and terminology, the fundamentals of the Windows operating system and have hands-on experience at the beginning to intermediate level using Microsoft Excel and Access. The Internet will be used to supplement textbook and lecture materials. Note: Students taking this course may not receive credit for BCS 102 or 202.","number":"160","subject":"BCS","title":"Computers, Society and Technology"},{"credit":0,"description":"This course introduces the architecture, structure, functions, components, and models of the Internet and other computer networks. The principles and structure of IPv4 and IPv6 addressing and the fundamentals of Ethernet concepts, media, and operations are introduced to provide a foundation for the curriculum. By the end of the course, students will be able to build simple LAN’s, perform basic configurations for routers and switches, and implement IP addressing schemes. The laboratory component of this course will give the students hands-on experience configuring equipment needed to build a LAN.","number":"208","subject":"BCS","title":"Introduction to Networks"}],"student":{"id":"102","major":"Computer Programming","name":"John Smith"}},{"courses":[{"credit":0,"description":"This course introduces the C++ Programming Language as a means of developing structured programs. Students will be taught to develop algorithms using top-down stepwise refinement. Students will be introduced to the concept of Object Oriented programming. In addition, students will get a thorough exposure to C++ syntax and debugging techniques.","number":"120","subject":"BCS","title":"Foundations of Computer Programming I"},{"credit":0,"description":"This is an introductory course in Web page authoring in which students will create Web pages using HTML (HyperText Markup Language) and CSS (Cascading Style Sheets). In addition to the introductory topics of changing text appearance, creating hyperlinks, and inserting images into a Web page, advanced topics such as layout, tables, and forms will also be covered. ","number":"130","subject":"BCS","title":"Website Development I"},{"credit":0,"description":"This course introduces students to JavaScript and jQuery. Students will learn how to write their own scripts in JavaScript, learn jQuery syntax, and use the jQuery and jQuery UI libraries. Students will learn how to devise jQuery and jQuery UI scripting techniques such as effects, animation, tabbed panels, menus, accordions, content sliders, drag and drop, tooltips, date pickers, custom tooltips, dialogs and portlets, and interactive image sliders and carousels.","number":"235","subject":"BCS","title":"JavaScript and jQuery"},{"credit":0,"description":"In this course, students will learn how to create websites that deliver a seamless experience across a diverse range of desktop and mobile devices using the same code base. In addition, students will learn how to perform forms validation, create navigation and menuing systems, build responsive layouts with flexible content, code media queries, and create and modify template and child pages. Students will use CSS 3 to create user interfaces with toolbars, animations, buttons, forms, lists, events, and themes.","number":"240","subject":"BCS","title":"Website Development II"}],"student":{"id":"103","major":"Computer Programming","name":"Lisa Brown"}},{"courses":[{"credit":0,"description":"This course will provide an introduction to programming logic and problem solving techniques using different programming languages. The topics covered in this course will provide the skills needed to learn languages such as Visual Basic, C+ + and JAVA. Topics include such items as constants and variables, data types, scope of variables, basic logic constructs, subroutines and functions.  Students who have completed BCS 120 or equivalent cannot take BCS 101.","number":"102","subject":"BCS","title":"Programming Concepts and Problem Solving"},{"credit":0,"description":"Managers have increasing responsibility for determining their information system needs and for designing and implementing information systems that support these needs. Management information systems integrate, for purposes of information requirements, the accounting, finance, and operations management functions of an organization. This course will examine the various levels and types of software and information systems required by an organization to integrate these functions.","number":"300","subject":"BCS","title":"Management Information Systems"}],"student":{"id":"103","major":"Business","name":"Russell Cooper"}}]